In [ ]:
# Example of Pandas merging with append and concat

In [1]:
import pandas as pd

In [2]:
#Read in the first CSV file
file1 = "Resources/weight1.csv"
df1 = pd.read_csv(file1)
df1

    name  weight_pounds
0    Joe            155
1   Tony            160
2  Susan            144

In [3]:
#Read in the first CSV file
file2 = "Resources/weight2.csv"
df2 = pd.read_csv(file2)
df2

       name  weight_pounds
0       Joe            255
1  Samantha            140
2      Tony            190

In [4]:
#Simply use append 
df3 = df1.append(df2)
df3

       name  weight_pounds
0       Joe            155
1      Tony            160
2     Susan            144
0       Joe            255
1  Samantha            140
2      Tony            190

In [5]:
#Or to ignore the index
df3 = df1.append(df2, ignore_index=True)
df3

       name  weight_pounds
0       Joe            155
1      Tony            160
2     Susan            144
3       Joe            255
4  Samantha            140
5      Tony            190

In [7]:
# Or you can use concat()
df3 = pd.concat([df1, df2], ignore_index=True)
df3

       name  weight_pounds
0       Joe            155
1      Tony            160
2     Susan            144
3       Joe            255
4  Samantha            140
5      Tony            190

In [11]:
#To merge horizontally:
df3 = pd.concat([df1, df2], axis=1)
df3

    name  weight_pounds      name  weight_pounds
0    Joe            155       Joe            255
1   Tony            160  Samantha            140
2  Susan            144      Tony            190

In [12]:
#Merge horizontally 
df3 = pd.merge(df1, df2, on=["name"], how="outer")
df3

       name  weight_pounds_x  weight_pounds_y
0       Joe            155.0            255.0
1      Tony            160.0            190.0
2     Susan            144.0              NaN
3  Samantha              NaN            140.0

In [13]:
#Merge horizontally, inner join which keeps only the intersection
df3 = pd.merge(df1, df2, on=["name"], how="inner")
df3

   name  weight_pounds_x  weight_pounds_y
0   Joe              155              255
1  Tony              160              190